app/controllers/posts_controller.rb

INSERT INTO "posts" ("text", "anger", "disgust", "fear", "joy", "sadness", "analytical", "confident", "tentative", "openness_big5", "conscientiousness_big5", "extraversion_big5", "agreeableness_big5", "emotional_range_big5", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    @post = @current_user.posts.new(post_params)

    if @post.save